{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "!": 5,
      ".": 6,
      "B": 7,
      "D": 8,
      "E": 9,
      "G": 10,
      "I": 11,
      "L": 12,
      "N": 13,
      "P": 14,
      "R": 15,
      "T": 16,
      "a": 17,
      "b": 18,
      "c": 19,
      "d": 20,
      "e": 21,
      "f": 22,
      "g": 23,
      "h": 24,
      "i": 25,
      "l": 26,
      "m": 27,
      "n": 28,
      "o": 29,
      "p": 30,
      "r": 31,
      "s": 32,
      "t": 33,
      "u": 34,
      "v": 35,
      "ar": 36,
      "in": 37,
      "ing": 38,
      "an": 39,
      "ear": 40,
      "lear": 41,
      "ning": 42,
      "learning": 43,
      "BE": 44,
      "De": 45,
      "GP": 46,
      "LP": 47,
      "NLP": 48,
      "RT": 49
    },
    "merges": [
      [
        "a",
        "r"
      ],
      [
        "i",
        "n"
      ],
      [
        "in",
        "g"
      ],
      [
        "a",
        "n"
      ],
      [
        "e",
        "ar"
      ],
      [
        "l",
        "ear"
      ],
      [
        "n",
        "ing"
      ],
      [
        "lear",
        "ning"
      ],
      [
        "B",
        "E"
      ],
      [
        "D",
        "e"
      ],
      [
        "G",
        "P"
      ],
      [
        "L",
        "P"
      ],
      [
        "N",
        "LP"
      ],
      [
        "R",
        "T"
      ]
    ]
  }
}